In [4]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Utah</th>
      <td>1.079823</td>
      <td>0.582689</td>
      <td>0.560683</td>
    </tr>
    <tr>
      <th>Ohio</th>
      <td>0.734106</td>
      <td>1.573452</td>
      <td>-1.126221</td>
    </tr>
    <tr>
      <th>Texas</th>
      <td>-0.337891</td>
      <td>-2.777264</td>
      <td>0.719014</td>
    </tr>
    <tr>
      <th>Oregon</th>
      <td>0.016963</td>
      <td>0.167700</td>
      <td>-0.884748</td>
    </tr>
  </tbody>
</table>
</div>

In [5]:
np.abs(df)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Utah</th>
      <td>1.079823</td>
      <td>0.582689</td>
      <td>0.560683</td>
    </tr>
    <tr>
      <th>Ohio</th>
      <td>0.734106</td>
      <td>1.573452</td>
      <td>1.126221</td>
    </tr>
    <tr>
      <th>Texas</th>
      <td>0.337891</td>
      <td>2.777264</td>
      <td>0.719014</td>
    </tr>
    <tr>
      <th>Oregon</th>
      <td>0.016963</td>
      <td>0.167700</td>
      <td>0.884748</td>
    </tr>
  </tbody>
</table>
</div>

In [25]:
df.iloc[0].min()
f = lambda x: x.max() - x.min()
df.apply(f ,axis='columns')

Utah      0.519140
Ohio      2.699673
Texas     3.496278
Oregon    1.052448
dtype: float64

In [27]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])

df.apply(f)

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>b</th>
      <th>d</th>
      <th>e</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>min</th>
      <td>-0.337891</td>
      <td>-2.777264</td>
      <td>-1.126221</td>
    </tr>
    <tr>
      <th>max</th>
      <td>1.079823</td>
      <td>1.573452</td>
      <td>0.719014</td>
    </tr>
  </tbody>
</table>
</div>

In [ ]:
format = lambda x: '%.2f' % x
df.applymap(format)
# applymap yani dar har series dakhele frame bia in function ro be har element dakhel series 
# map kon. 
# The reason for the name applymap is that Series has a map method for applying an
# element-wise function

Utah       0.56
Ohio      -1.13
Texas      0.72
Oregon    -0.88
Name: e, dtype: object

In [32]:
df['e'].map(format)

Utah       0.56
Ohio      -1.13
Texas      0.72
Oregon    -0.88
Name: e, dtype: object